{
    "BioText": "I'm Sean Otto, a software engineer based in the beautiful hills of Surrey, UK. \n\nI love developing games, front end websites and small command line programs.\n\nI'm passionate about emergent-tech, beautiful interfaces and intuitive programming. I also love my gf sooooo much \n\nTo find out more about any of my projects, feel free to select any of the links on the right!",
    "Projects": [
    {
        "title": "This Website!",
        "desc": "This website was made with Gatsby and React, using a small JSON file to emulate a kind of back-end. \n\n Feel free to modify and use for your own portfolio, you can find the repo below:",
        "githubURL": "https://github.com/seanj29/portfolio",
        "tag": "web"
    },
    {
        "title": "vscode-language-renpy",
        "imagekey": "VSRenpy",
        "desc": "Contributed to an extension that adds VSCode support to the Renpy Programming Language.\n\n  Mostly a Typescript project, with a little bit of node for the running process",
        "githubURL": "https://github.com/seanj29/vscode-language-renpy",
        "tag": "web"
    },
    {
        "title": "Minotaurus",
        "imagekey": "Minotaurus",
        "desc": "A game where you wander around as a minotaur in a dungeon hunting mages (who also throw fireballs!). \n\nMade using Phaser and JavaScript. Code is available on github, and feel free to play it in the browser on itch!",
        "githubURL": "https://github.com/seanj29/Minotaurus",
        "itchURl":"https://seanj29.itch.io/minotaurus",
        "tag": "game"
    },
    {
        "title": "Diece",
        "imagekey": "Diece",
        "desc": "A short section of a turn based combat module made in Renpy, where you play as a little guy and run do some combat against some not so little guys.\n\n Feel free to edit it and use it as you wish",
        "githubURL": "https://github.com/seanj29/Diece",
        "itchURl":"https://seanj29.itch.io/diece-student-project",
        "tag": "game"
    },
    {
        "title": "TicTacToeMultiplayer",
        "imagekey": "TicTac",
        "desc": "A tic tac toe client/server pair made with SDL2 and Java. Uses TCP to transfer a single string over a network port. \n\nServer was made in Java using the FXGL game engine.",
        "githubURL": "https://github.com/seanj29/CI628-PongClient-master",
        "tag": "game"
    },
    {
        "title": "Trade-Checker",
        "desc": "Simple Command Line program I made for a coding challenge that monitors a folder for a specific file to be added, then moves that file to an archive and adds it to a database. \n\n Uses C# for the program and SQLite for the backend.",
        "githubURL": "https://github.com/seanj29/Trade-checker",
        "tag": "misc"
    }
    ]
}